Repository: pypi-data/pypi-mirror-270
Catalog: packages/pyams-sequence/pyams_sequence-2.1.0.tar.gz/pyams_sequence-2.1.0/src/pyams_sequence/locales/*/LC_MESSAGES/pyams_sequence.po
Languages: fr

source: Can't set last OID to value lower than current one!
fr: Vous ne pouvez pas redéfinir la valeur du dernier OID à une valeur inférieure à sa valeur actuelle

source: Hexadecimal prefix
fr: Préfixe hexadécimal

source: Prefix used to generate hexadecimal ID
fr: Préfixe utilisé pour générer les identifiants hexadécimaux

source: Hexadecimal ID length
fr: Longueur de l'ID hexadécimal

source: Full length of hexadecimal ID, not including prefix
fr: Longueur complète de l'ID hexadécimal, non compris le préfixe

source: Last OID
fr: Dernier OID

source: Last used sequence; WARNING: you can change this to a higher value, but never to a lower one!
fr: Dernier numéro de séquence utilisé ; ATTENTION : vous pouvez redéfinir une valeur supérieure, mais jamais une valeur inférieure à la valeur actuelle !

source: Sequential ID
fr: N° de séquence

source: Unique ID
fr: ID unique

source: Sequence name
fr: Nom de séquence

source: Name of registered sequence utility used to get unique IDs
fr: Nom de la séquence enregistrée utilisée pour générer les identifiants uniques

source: Prefix used to generate hexadecimal ID, placed after utility prefix. Generally defined at class level...
fr: Préfixe hexadécimal spécifique ajouté après le préfixe de la séquence ; généralement paramétré au niveau de la classe, pour concerner tous les contenus d'un même type...

source: Internal reference
fr: Référence interne

source: Internal link target reference. You can search a reference using '+' followed by internal number, of by entering text matching content title.
fr: Vous pouvez définir une référence interne en indiquant un "+" directement suivi de l'identifiant du contenu que vous souhaitez associer, ou en entrant du texte correspondant au titre du contenu recherché...

source: Internal references
fr: Références internes

source: List of internal references
fr: Vous pouvez définir une liste de références internes en les sélectionnant une par une ; vous pouvez créer une référence en indiquant un "+" directement suivi de l'identifiant du contenu que vous souhaitez associer, ou en entrant du texte correspondant au titre du contenu recherché...

source: No selected reference
fr: Aucune référence sélectionnée

source: Sequences manager
fr: Gestionnaire de séquences

source: Sequences generator
fr: Générateur de séquences

source: Properties
fr: Propriétés
